app/controllers/events_controller.rb

  def create
    @event = Event.new

    @event.game = params[:game]

    @event.played_on = params[:played_on]

    @event.gametime = params[:gametime]

    @event.home_team = params[:home_team]

    @event.away_team = params[:away_team]



    if @event.save
---
INSERT INTO "events" ("away_team", "created_at", "game", "gametime", "home_team", "played_on", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])


    @event.game = params[:game]

    @event.played_on = params[:played_on]

    @event.gametime = params[:gametime]

    @event.home_team = params[:home_team]

    @event.away_team = params[:away_team]



    if @event.save
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "away_team" = ?, "home_team" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["away_team", "Chicago Bears"], ["home_team", "Green Bay Packers"], ["updated_at", "2014-06-06 21:29:43.597755"]]