app/controllers/plays_controller.rb

  def index
    @plays = Play.all
---
SELECT "plays".* FROM "plays"

  def create
    @play = Play.new

    @play.type = params[:type]

    @play.fault = params[:fault]



    if @play.save
---
INSERT INTO "plays" ("created_at", "fault", "type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-07 04:17:58.289131"], ["fault", "t"], ["type", "score"], ["updated_at", "2014-06-07 04:17:58.289131"]]