app/controllers/players_controller.rb

INSERT INTO "players" ("created_at", "image_url", "name", "position", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @player = Player.new

    @player.name = params[:name]

    @player.position = params[:position]

    @player.image_url = params[:image_url]



    if @player.save